import React from 'react'
import "./Support.css"

const Support = () => {
  return (
    <>
    <h1>Пользовательское соглашение</h1>
    <p>Политика конфиденциальности
Настоящая Политика конфиденциальности персональной информации (далее — Политика) действует в отношении всей информации, которую ООО «Bellissimo Pizza International» (далее — OOO “Bellissimo Pizza International”) и/или его аффилированные лица, включая все лица, объединенные в рамках франчайзинговой сети под брендом «Bellissimo Pizza» (далее - «Bellissimo Pizza»), могут получить о Пользователе (любое физическое лицо, предоставившее «Bellissimo Pizza» свои персональные данные посредством регистрации на сайте bellissimo.uz, в Telegram-боте @bellissimo_bot, в мобильном приложении Bellissimo Pizza) во время использования им любого из сайтов, сервисов, служб и программ «Bellissimo Pizza» (далее — Сервисы). Согласие Пользователя на предоставление персональной информации, данное им в соответствии с настоящей Политикой в рамках отношений с одним из лиц, входящих в «Bellissimo Pizza», распространяется на все лица, входящие в «Bellissimo Pizza».

Использование Сервисов означает безоговорочное согласие Пользователя с настоящей Политикой и указанными в ней условиями обработки его персональной информации; в случае несогласия с этими условиями Пользователь должен воздержаться от использования Сервисов.

1. Персональная информация Пользователей, которую получает и обрабатывает «Bellissimo Pizza»

1.1. В рамках настоящей Политики под «персональной информацией Пользователя» понимаются:

1.1.1. персональная информация, которую Пользователь предоставляет о себе самостоятельно при регистрации (создании учётной записи) или в процессе использования Сервисов, включая персональные данные Пользователя.

Обязательная для предоставления Сервисов (оказания услуг) информация помечена специальным образом. Иная информация предоставляется Пользователем на его усмотрение.

1.1.1.1. Номер мобильного телефона.
1.1.1.2. ФИО.
1.1.1.3. ГЕО-локация места доставки.
1.1.1.4. Адрес места доставки.
1.1.1.5. Дата Рождения.

1.1.2. данные, которые автоматически передаются Сервисам в процессе их использования с помощью установленного на устройстве Пользователя программного обеспечения, в том числе IP-адрес, device ID, информация из cookie, информация о браузере Пользователя (или иной программе, с помощью которой осуществляется доступ к Сервисам), время доступа, адрес запрашиваемой страницы.

1.2. Настоящая Политика применима только к Сервисам «Bellissimo Pizza». «Bellissimo Pizza» не контролирует и не несет ответственность за сайты третьих лиц, на которых упоминается бренд Bellissimo Pizza.

1.3. «Bellissimo Pizza» исходит из того, что Пользователь предоставляет достоверную и достаточную персональную информацию при регистрации в мобильном приложении для осуществления компанией Bellissimo Pizza своих обязательств перед пользователем. Обязательства по доставке товара отражена в Публичной Оферте (далее – Оферта), расположенной на сайте bellissimo.uz. Последствия предоставления недостоверной информации определены в Оферте, расположенной на сайте bellissimo.uz.

2. Цели сбора и обработки персональной информации Пользователей

2.1. «Bellissimo Pizza» собирает и хранит только те персональные данные, которые необходимы для предоставления Сервисов и оказания услуг (исполнения оферты и/или иных договоров с Пользователем).

2.2. Персональную информацию Пользователя «Bellissimo Pizza» может использовать в следующих целях:

2.2.1. идентификация стороны в рамках оферты и договоров с «Bellissimo Pizza»;

2.2.2. предоставление Пользователю персонализированных Сервисов;

2.2.3. связь с Пользователем, в том числе направление уведомлений, запросов и информации, касающихся использования Сервисов, оказания услуг, а также обработка запросов и заявок от Пользователя;

2.2.4. улучшение качества Сервисов, удобства их использования, разработка новых Сервисов и услуг;

2.2.5. рекламы своих продуктов и услуг;

2.2.6. проведение статистических и иных исследований на основе предоставленных данных.

3. Условия обработки персональной информации Пользователя и её передачи третьим лицам
3.1. «Bellissimo Pizza» хранит персональную информацию Пользователей, обеспечивая их конфиденциальность и защиту от неправомерного или случайного доступа к ним третьих лиц.

3.2. «Bellissimo Pizza» вправе передать персональную информацию Пользователя третьим лицам в следующих случаях:

3.2.1. передача необходима в рамках использования Пользователем определенного Сервиса, либо для оказания услуги Пользователю;

3.2.2. такая передача происходит в рамках продажи или иной передачи бизнеса (полностью или в части), при этом к приобретателю переходят все обязательства по соблюдению условий настоящей Политики применительно к полученной им персональной информации;

3.2.3. в целях обеспечения возможности защиты прав и законных интересов «Bellissimo Pizza» или третьих лиц в случаях, когда Пользователь нарушает оферту «Bellissimo Pizza».

3.4. При обработке персональных данных Пользователей «Bellissimo Pizza» руководствуется Законом Республики Узбекистан «О персональных данных» от 02.07.2019 года №ЗРУ-547.

4. Меры, применяемые для защиты персональной информации Пользователей

«Bellissimo Pizza» принимает необходимые и достаточные организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.

5. Изменение Политики конфиденциальности

«Bellissimo Pizza» имеет право вносить изменения в настоящую Политику. При внесении изменений в актуальной редакции указывается дата последнего обновления. Пользователь обязуется самостоятельно контролировать наличие изменений в настоящей Политике. Новая редакция Политики вступает в силу с момента ее размещения, если иное не предусмотрено новой редакцией Политики. Действующая редакция всегда находится на сайте bellissimo.uz.
</p>
    </>
  )
}

export default Support