import React from 'react'
import "./Garant.css"

const Garant = () => {
  return (
    <>
    <h1 className='h'>Публичная оферта</h1>
    <p>Публичная оферта
Договор-оферты об осуществлении продажи через Электронную инфраструктуру
Настоящий договор-оферты об осуществлении продажи через Электронную инфраструктуру (далее – «Условия») устанавливают существенные условия оказания услуг по изготовлению и реализации продукции общественного питания и других товаров.
Условия являются публичной офертой - предложением о заключении Договора розничной купли-продажи товаров и оказания услуг общественного питания и их доставки Продавцом Покупателю. Покупатель, ознакомившись с настоящими Условиями, присоединяется к ним и выражает свое согласие с ними путем совершения действий, указанных в настоящих Условиях.
В Telegram-боте и на сайте предоставлена информация об основных потребительских свойствах Товара, об адресе (месте нахождения) продавца, о месте изготовления товара, о полном фирменном наименовании (наименовании) продавца (изготовителя), о цене и об условиях приобретения товара, о его доставке, о порядке оплаты товара, сроке годности, а также о сроке, в течение которого действует предложение о заключении Договора.


1. Термины
1.1. Покупатель – физическое лицо, имеющее намерение заказать или заказывающее Товар на сайте promo.kudapizza.uz, через Telegram-бот @bellissimo_bot, мобильное приложение Bellissimo Pizza или телефонным звонком по номеру (71)203-66-66 или “1174”, использующее услуги общественного питания исключительно для личных, семейных, домашних и иных нужд, не связанных с осуществлением предпринимательской деятельности и согласившееся на приобретение товаров и оказание услуг общественного питания в соответствии с настоящими Условиями.
1.2. Продавец –ООО «  KUDAPIZZA PIZZA INTERNATIONAL»
1.3. Товар – продукция в соответствии с ассортиментом, представленным на Интернет-сайте Продавца по адресу: promo.bellissimo.uz и в Telegram-боте;
1.4. Заказ – отдельные позиции (позиция) из ассортиментного перечня Товаров, выбранные и заказанные Покупателем посредством Telegram-бота либо по телефонам (71)203-66-66 или 1174, и оформленные на доставку по указанному Покупателем адресу;
1.5. Сайт – интернет-сайт Продавца promo.bellissimo.uz;
1.6. Телеграмм-бот – программа (бот), работающая на базе мессенджера Telegram с именем пользователя @bellissimo_bot.
1.8. Колл-центр – подразделение Продавца, занимающееся обработкой заказов и информированием по голосовым каналам связи через телефонные номера: +99871 203-66-66 или 1174
1.9. Электронная инфраструктура - Сайт, Мобильное приложение, Телеграмм-бот и Колл-центр вместе взятые.
1.10. Служба доставки – сотрудники Продавца либо представители Продавца, осуществляющие доставку Товаров Покупателю.


2. Общие положения
2.1. Настоящие Условия, а также информация о Товаре и услугах, представленная в Электронной инфраструктуре, являются публичной офертой в смысле статьи 367 и пункта 2 статьи 369 ГК Республики Узбекистан на заключение Договора розничной купли-продажи товаров и услуг.
2.2. К отношениям между Покупателем и Продавцом применяются положения Гражданского кодекса Республики Узбекистан, Закона Республики Узбекистан «О защите прав потребителей», Правила производства и реализации продукции (услуг) общественного питания в Республике Узбекистан, и иные правовые акты, принятые в соответствии с ними.
2.3. Продавец оставляет за собой право вносить изменения в настоящие Условия и публиковать Условия с внесенными изменениями в Электронной инфраструктуре.
2.4. Покупатель соглашается с настоящими Условиями, принимает их и присоединяется к условиям настоящего Соглашения следующим образом:
- нажатием кнопки «Оформить заказ» на последнем этапе оформления Заказа в Телеграмм-боте,
- подтверждением заказа по телефону через Колл-центр;
-подтверждением Заказа через сайт;
-подтверждением Заказа через мобильное приложение.
2.5. Заказ Товара, оформленный Покупателем в Электронной инфраструктуре является подтверждением заключенного между Продавцом и Покупателем Договора.
2.6. Право собственности на Товары переходит к Покупателю в момент приемки Товаров Покупателем и оплаты последним полной стоимости принятых Товаров. Риск случайной гибели или повреждения Товаров переходит к Покупателю с момента приемки Товаров Покупателем.
2.7. Принимая (акцептируя) настоящие Условия, Покупатель подтверждает свое согласие и разрешает Продавцу обрабатывать свои данные, в том числе: имя, адрес доставки, телефон, адрес электронной почты. Под обработкой персональных данных в настоящих Условиях понимается: сбор вышеуказанных данных, их систематизация, накопление, хранение, уточнение (обновление, изменение), использование, блокирование, уничтожение, передача третьим лицам в целях проведения маркетинговых мероприятий и исследований.
2.8. Принимая настоящие Условия, Покупатель выражает согласие и разрешает Продавцу и его службам обрабатывать персональные данные Покупателя с помощью автоматизированных систем управления базами данных, а также иных программных и технических средств, выражает согласие на получение sms-сообщений, на участие в маркетинговых акциях и мероприятиях, а также на получение рекламных сообщений.
2.9. Продавец обязуется обеспечивать конфиденциальность предоставленных Покупателем персональных данных, их защиту от копирования, распространения. В любой момент Покупатель вправе запросить перечень своих персональных данных и/или потребовать изменить, заблокировать либо уничтожить свои персональные данные, позвонив Продавцу по телефону +998712036666, указав имя, телефон, а также адрес доставки, либо направив уведомление в электронном виде по адресу: bellissimopizzauz@gmail.com.


3. Оформление и сроки выполнения Заказа
3.1. Заказ может быть оформлен Покупателем одним из следующих способов:
- с помощью размещения Заказа через Колл-центр,
- с помощью Телеграмм-бота;
- с помощью мобильного приложения;
-с помощью сайта.
3.2. При оформлении Заказа посредством Электронной инфраструктуры Покупатель подтверждает, что он ознакомлен с настоящими Условиями и предоставляет Продавцу всю информацию, необходимую для надлежащего оформления и исполнения Заказа.
3.3. Для оформления Покупателем Заказа при помощи Телеграмм-бота, необходимо выбрать подходящий товар из разделов «Меню», выбрать количество товара и добавить Товар(ы) в корзину. При заказе двух и более позиций Товара описанные операции необходимо повторить в отношении каждой товарной позиции. Далее, необходимо перейти в раздел «Корзина», в «Корзине» проверить количество и перечень заказываемого Товара (при необходимости изменить соответствующие сведения), далее нажать кнопку «Оформить заказ». На открывшейся странице заполнить обязательные поля, касающиеся личных данных, а также адреса доставки Покупателя, выбрать время доставки, способ оплаты заказа и нажать кнопку «Оформить заказ». Нажимая кнопку «Оформить заказ» и «Заказать», Покупатель завершает оформление Заказа. После этого сотрудники Продавца, при необходимости, могут связаться с Покупателем для подтверждения указанных сведений либо с целью корректировки заказа;
Для оформления Покупателем Заказа через сайт ………..
Для оформления Покупателем Заказа через мобильное приложение ……
3.4. При оформлении Заказа посредством Электронной инфраструктуры Покупатель должен указать следующую информацию:
-имя;
-контактный телефон;
- сведения о месте доставки (включая город, улицу, дом, корпус/строение, № квартиры/офиса, подъезд, этаж, код домофона, комментарии к адресу доставки);
- комментарии и промокод (при необходимости);
3.5. После оформления заказа Клиенту предоставляется информация о статусе исполнения Заказа, в том числе о сроке доставки Товара.
3.5.1. Гарантия «35 минут или пицца в подарок» действует на все заказы на доставку, оформленные по телефону «1174», через Telegram-бот @bellissimo_bot , мобильное приложение Bellissimo Pizza и на сайте bellissimo.uz.
3.5.2. Действие гарантии «35 минут или пицца в подарок»будет изменено в связи с увелечением срока доставки в нижеследующих случаях, Клиенту будет направлено смс-уведомление:
А)Праздничные дни(установленные в соответствии с законодательством Республики Узбекистан) -время доставки будет составлять от 45 минут до 1.30 минут;
Б)Каждую пятницу с 12:00 до 14:00 – время доставки будет составлять 60 минут.
В случае возникновения форс-мажорных ситуаций действие гарантии «35 минут или пицца в подарок» может быть остановлено в одностороннем порядке, информация об этом будет предоставлена на сайте Bellissimo.uz, в Telegram-боте @bellissimo_bot и в социальных сетях BellissimoPizza.
3.5.3. В случае опоздания курьера (более 35 минут с момента оформления заказа) покупателю будет предоставлен Подарочный Сертификат на любую среднюю пиццу. Сертификат активируется через 24 часа и действует в течение 7 дней (на доставку, заказы в филиалах и на вынос).
3.5.4. Подарочный Сертификат на пиццу не выдается, если опоздание случилось по вине покупателя (не верно или не в полной мере указан адрес/локация/контактный телефон или не отвечает на звонки курьера).
3.5.5. В случае возникновения спорных ситуаций по поводу действия акции «35 минут или Пицца в Подарок» можно связаться с отделом качества сервиса по номеру: (+99855) 5011174
3.6. Доставка заказов осуществляется 24/7 только по городу Ташкента.
3.7. Ответственность за содержание и достоверность информации, предоставленной Покупателем при оформлении Заказа, несет Покупатель. Если при оформлении Заказа Покупателем была указана неправильная информация, в том числе неправильный адрес, неправильные телефоны, адреса электронной почты и другие данные, Продавец не несет ответственность за возникшие в связи с указанными обстоятельствами последствиями в виде невозможности исполнения Заказа, его доставки вовремя и по указанному адресу, неполучения Покупателем подтверждения оформления Заказа на указанный им адрес. Также в случае указания неверного адреса и контактов, что влечет за собой задержку срока доставки Товара по вине Покупателя, гарантийный купон не выдается.
3.8. Вся информация о Товаре, представленная в Электронной инфраструктуре, носит информационный характер, не является рекламой и не может в полной мере передавать всю информацию о свойствах и характеристиках Товара.
3.9. Фото, схемы, рисунки, видеоизображения образцов Товара в каталоге являются собственностью Исполнителя. Каждое изображение образца сопровождается текстовой информацией о Товаре.
3.10. В случае отсутствия заказанных Товаров у Продавца (в том числе – по причинам, не зависящим от него), Продавец вправе исключить указанный Товар из Заказа и уведомить об этом Покупателя по телефону в течение 20 минут с момента совершения таких действий.
3.11. Покупатель может получить оформленный Заказ путем доставки Товара службой доставки Продавца либо лично прибыть в ресторан Продавца, получить оформленный Заказ и произвести оплату.


4. Доставка Товара.
4.1. Продавец приложит все усилия для соблюдения сроков доставки, тем не менее, задержки в доставке возможны ввиду непредвиденных обстоятельств, произошедших не по вине Продавца.
4.2. В случае отсутствия Покупателя (либо Получателя) в назначенных месте и времени доставки, сотрудник Службы доставки ожидает 5 минут, после чего уезжает.
4.3. Передача заказа
- Покупатель обязуется проверить комплектацию всего Заказа (ассортимент) и каждого Товара в отдельности;
- В случае отсутствия претензий к Товарам Покупатель оплачивает сотруднику Службы доставки либо сотруднику ресторана их стоимость (если платеж не был осуществлен ранее) и получает фискальный чек.
- При авансовой оплате Заказа (с помощью электронных платежных систем и пр.), Покупатель (либо назначенный им Получатель) обязан предъявить документ, удостоверяющий личность.
4.4. В случае недоставки Товара Продавец возмещает Покупателю стоимость предоплаченного, но не полученного Товара после подтверждения данного обстоятельства со стороны Службы доставки.
4.5. При доставке Товар вручается Покупателю либо лицу, указанному в качестве Получателя.
4.6. Во избежание случаев мошенничества при вручении предоплаченного Товара сотрудник Службы доставки вправе затребовать документ, удостоверяющий личность Получателя. Продавец гарантирует конфиденциальность и защиту персональной информации, полученной от Получателя.
4.7. В случае неполучения Заказа покупателем по его вине, стоимость Товара и его доставки не компенсируются. Денежные средства за нее не возвращаются.
4.8. Если Покупатель оплатил и не забрал товар в оговоренные сроки, Исполнитель имеет право не возвращать оплату за Товар Покупателю.
4.9. Исполнитель имеет право изменить время передачи товаров, уведомив об этом покупателя услуг не позднее оговоренного времени отгрузки заказа, получив подтверждение о согласии Покупателя с изменениями. Покупатель имеет право отказаться от внесения изменений в данные заказанной услуги, на основании чего услуги будут считаться отмененными с последующим возвратом денежных средств на карту, с которой производилась оплата.


5. Оплата товара
5.1. Цена Товара указывается в Электронной инфраструктуре.
5.2. Цена Товара может быть изменена Продавцом. При этом стоимость Заказа, оговоренная при подтверждении его оформления, изменению в одностороннем порядке, не подлежит.
5.3. Способы оплаты Товара:
- Наличными денежными (в национальной валюте сум) средствами курьеру при получении Заказа;
- Банковской картой в национальной валюте сум;
- посредством платежной системы PayMe.
5.4. В связи с постановлением Президента Республики Узбекистан, все пакеты предоставляются платно.


6. Возврат Товара
6.1. При получении Товаров Покупатель проверяет соответствие полученных Товаров Заказу, комплектность и отсутствие претензий к внешнему виду доставленного Товаров. Претензии Покупателя по внешнему виду Товаров и их комплектности, после приемки Товара, не принимаются.
6.2. Продовольственные товары надлежащего качества возврату не подлежат.
6.3. Возврат Товара ненадлежащего качества:
6.3.1. Покупатель вправе возвратить Продавцу либо не принять Товар ненадлежащего качества и потребовать возврата уплаченной цены такого Товара. Клиент также может потребовать замены Товара ненадлежащего качества.
6.3.2. В случае отказа Покупателя от приемки Товара и предъявления им требования о возврате уплаченной за Товар денежной суммы, в случае, если указанная сумма уже была уплачена, сумма подлежит возврату Покупателю в течение 10 (десяти) дней с момента получения Продавцом указанного требования в письменной форме.
6.4. Возврат денежных средств:
6.4.1. Денежные средства подлежат возврату Покупателю способом, аналогичным примененному им при оплате Товара: при оплате Заказа наличными денежными средствами- возврат осуществляется денежными средствами из кассы Продавца, при осуществлении платежа банковской картой- возврат денежных средств производится на банковскую карту;
6.4.2. В случае если возврат наличных денежных средств осуществляется неодновременно с возвратом товара Клиентом, возврат указанной суммы осуществляется Продавцом с согласия Клиента одним из следующих способов:
а) наличными денежными средствами по месту нахождения Продавца;
б) путем перечисления соответствующей суммы на банковский или иной счет Клиента,
6.5. Порядок действий при нарушении Продавцом условия об ассортименте (при пересортице):
6.5.1. В случае обнаружения в Заказе Товара, не соответствующего заказанному по ассортименту, Покупатель вправе при передаче отказаться от данного Товара и потребовать замены на Товар, предусмотренный Заказом, либо возврата денежных средств за фактически не переданный Товар.
6.5.2. Товар, переданный Покупателю в нарушение условия об ассортименте, подлежит возврату Продавцу. В случае если Покупатель принимает данный Товар, Продавец вправе потребовать от Покупателя оплаты данного Товара по цене, установленной Продавцом для данного Товара на Сайте на момент передачи Товара. Если фактически переданный Товар отсутствует в ассортименте Продавца, представленном на Сайте на момент передачи Товара, данный Товар оплачивается по цене, согласованной с Продавцом.
6.5.3. В случае невозможности осуществить замену Товара, Продавец уведомляет об этом Покупателя по номеру телефона, указанному Покупателем при оформлении Заказа, а денежные средства, фактически оплаченные за не переданный Товар, возвращаются.
6.5.4. Денежные средства, оплаченные Покупателем за фактически непереданный Товар, подлежат возврату в течение 10 (десяти) дней с момента получения письменного требования Покупателя об их возврате и подтверждения сотрудников Продавца. Возврат уплаченной за Товар суммы осуществляется способом, аналогичным примененному при оплате Товара.
6.6. Порядок действий при нарушении Продавцом условия о количестве.
6.6.1. При передаче Товара Покупатель обязан проверить его количество на соответствие Заказу. Если Покупателем обнаружены расхождения по количеству Товара, он обязан зафиксировать указанный факт в присутствии сотрудника Службы доставки (курьера).
6.6.2. Если Продавец передал Покупателю меньшее количество Товара, чем определено Заказом, Покупатель при передаче Заказа вправе принять Товар в части, соответствующей Заказу, и потребовать передать недостающее количество Товара, либо (если недостающий Товар был оплачен) отказаться от Заказа в части недостающего Товара и потребовать возврата денежных средств за недостающий Товар.
6.6.3. В случае невозможности передать недостающий Товар Продавец уведомляет об этом Покупателя по номеру телефона, указанному им при оформлении Заказа, а денежные средства, фактически оплаченные за недостающий Товар, возвращаются.
6.6.4. Денежные средства, оплаченные Покупателем за недостающий Товар, подлежат возврату в течение 10 (десяти) дней с момента получения Продавцом уведомления Покупателя о возврате денежных средств вместе с копией Заказа с отметкой о недоставке части Товара. Возврат уплаченной за Товар денежной суммы осуществляется способом, аналогичным примененному при оплате Товара, или иным способом по согласованию с Клиентом с учетом положений п 6.6. относительно порядка возврата денежных средств на банковскую карту.
6.6.5. В случае, если в бланке Заказа (накладной) отсутствует отметка Покупателя и сотрудника службы доставки о недостающем Товаре, Продавец вправе отказать Покупателю в удовлетворении претензий по количеству либо по качеству переданного Товара.


7. Гарантии и ответственность
7.1. Продавец гарантирует, что подлежащий поставке Товар надлежащего качества, соответствует основным требованиям законодательства, применяемым в отношении Товара. Товар хранению не подлежит, за исключением продовольственных товаров заводского способа изготовления.
7.2. Продавец не несет ответственности за ущерб, который может быть причинен Покупателю вследствие ненадлежащего использования Товаров, заказанных на Сайте. Товар подлежит употреблению непосредственно после доставки.
7.3. Покупатель обязуется не использовать заказанный Товар в предпринимательских целях.
7.4. Продавец вправе переуступать либо каким-либо иным способом передавать свои права и обязанности, вытекающие из его отношений с Клиентом, третьим лицам.


8. Политика конфиденциальности и защита персональных данных
8.1. Продавец имеет право обрабатывать и хранить персональные данные Покупателя, предоставленные Продавцу, с согласия Покупателя, выраженного путем присоединения к условиям настоящего Соглашения, обеспечивать их конфиденциальность и не предоставлять доступ к этой информации третьим лицам, за исключением случаев, предусмотренных настоящим Соглашением и действующим законодательством Республики Узбекистан.
8.2. Принимая настоящее Соглашение, Покупатель подтверждает свое согласие и разрешает Продавцу обрабатывать свои персональные данные, в том числе: имя, адрес доставки, телефон, адрес электронной почты. Под обработкой персональных данных в настоящем Соглашении понимается: сбор вышеуказанных данных, их систематизация, накопление, хранение, уточнение (обновление, изменение), передачу третьим лицам в целях проведения маркетинговых, рекламных мероприятий и исследований, использование, блокирование, уничтожение. Продавец вправе поручить обработку персональных данных Покупателей третьим лицам. Покупатель соглашается, что его согласия на обработку персональных данных третьим лицом не требуется.
8.4. Принимая настоящее Соглашение, Покупатель выражает согласие и разрешает Продавцу и его службам обрабатывать персональные данные Покупателя с помощью автоматизированных систем управления базами данных, а также иных программных и технических средств.
8.5. Продавец использует персональные данные и информацию, получаемую от Покупателя:
- для выполнения своих обязательств перед Покупателем;
- для оценки и улучшения работы Telegram-бота;
- для связи с Покупателем, в том числе направление уведомлений, запросов в целях оказания услуг, а также в целях обработки запросов и заявок от Покупателя;
- в целях улучшения качества услуг, удобства их использования, разработки новых услуг и блюд;
- статистических и маркетинговых исследований, в том числе касающихся работы Сайта, качества продукции, качества обслуживания;
- для направления информационных sms-сообщений, а также для направления электронных писем и иных форм направления/получения информации по телефону либо электронному адресу Покупателю;
- для проведения маркетинговых мероприятий, направления рекламных сообщений и предложений для участия в специальных акциях и мероприятиях;
8.6. Разглашение информации, полученной Продавцом:
8.6.1. Продавец обязуется не разглашать полученные от Покупателя персональные данные.
8.6.2. Не считается разглашением информации поручение ее обработки Продавцом агентам и третьим лицам, действующим на основании договора с Продавцом, для исполнения обязательств перед Покупателем, а также в целях проведения маркетинговых, рекламных мероприятий и исследований. Не считается нарушением обязательств разглашение персональных данных в случаях, предусмотренных действующим законодательством Республики Узбекистан.
8.7. Продавец вправе осуществлять записи телефонных разговоров с Покупателем в целях улучшения качества предоставляемых услуг. При этом Продавец обязуется предотвращать попытки несанкционированного доступа к информации, полученной в ходе телефонных переговоров, и/или передачу ее третьим лицам, не имеющим непосредственного отношения к исполнению заказов.
8.8. В любой момент Покупатель вправе запросить перечень своих персональных данных и/или потребовать изменить, заблокировать либо уничтожить свои персональные данные, позвонив Продавцу по телефону +998712036666, указав имя, телефон, Email адрес, а также адрес доставки, либо направив уведомление в электронном виде по адресу bellissimopizzauz@gmail.com.


9. Прочие условия
9.1. Все возникающее споры стороны будут стараться решить путем переговоров. При не достижении соглашения спор будет передан на рассмотрение в суд в соответствии с действующим законодательством Республики Узбекистан.
9.2. Признание судом недействительности какого-либо из положений настоящих Правил не влечет за собой недействительность остальных положений.</p>
    </>
  )
}

export default Garant